#+PROPERTY: header-args:sql :engine postgres :dbhost "localhost" :dbport 5432 :dbuser "co" :database "pgexercises"
#+TITLE: SQL Learning Journey - PGExercises Solutions
#+AUTHOR: Co
#+DESCRIPTION: Solutions for exercises found at https://pgexercises.com/
#+OPTIONS: toc:nil num:nil

This file contains questions and my approach from [[https://pgexercises.com/][postgresql execises]].
*** emacs icin bazi ayarlar
Bu kisim uygulamam icin bazi ayarlari icermekte olup deneme yapmam icin vardir konudan bagimsizdir.
#+begin_src sql
SELECT current_database();
#+end_src

#+RESULTS:
| current_database |
|-----------------|
| pgexercises     |

#+BEGIN_SRC sql 
SELECT * FROM cd.members LIMIT 5;
#+END_SRC

#+RESULTS:
| memid | surname  | firstname | address                      | zipcode | telephone      | recommendedby | joindate            |
|-------+----------+-----------+------------------------------+---------+----------------+---------------+---------------------|
|     0 | GUEST    | GUEST     | GUEST                        |       0 | (000) 000-0000 |               | 2012-07-01 00:00:00 |
|     1 | Smith    | Darren    | 8 Bloomsbury Close, Boston   |    4321 | 555-555-5555   |               | 2012-07-02 12:02:05 |
|     2 | Smith    | Tracy     | 8 Bloomsbury Close, New York |    4321 | 555-555-5555   |               | 2012-07-02 12:08:23 |
|     3 | Rownam   | Tim       | 23 Highway Way, Boston       |   23423 | (844) 693-0723 |               | 2012-07-03 09:32:15 |
|     4 | Joplette | Janice    | 20 Crossing Road, New York   |     234 | (833) 942-4710 |             1 | 2012-07-03 10:25:05 |

#+begin_src sql 
select * from cd.members limit 2;
#+end_src

#+RESULTS:
| memid | surname | firstname | address                    | zipcode | telephone      | recommendedby | joindate            |
|-------+---------+-----------+----------------------------+---------+----------------+---------------+---------------------|
|     0 | GUEST   | GUEST     | GUEST                      |       0 | (000) 000-0000 |               | 2012-07-01 00:00:00 |
|     1 | Smith   | Darren    | 8 Bloomsbury Close, Boston |    4321 | 555-555-5555   |               | 2012-07-02 12:02:05 |

* Basic
** Retrieve everything from a table
*** Question

How can you retrieve all the information from the cd.facilities table? 
*** EDA
Önce tablonun sütun isimlerini ve veri tiplerini kontrol edelim:

#+BEGIN_SRC sql
-- Tablo yapısını inceleme
SELECT column_name, data_type 
FROM information_schema.columns 
WHERE table_name = 'facilities' AND table_schema = 'cd';
#+END_SRC

#+RESULTS:
| column_name         | data_type          |
|--------------------+-------------------|
| facid              | integer           |
| name               | character varying |
| membercost         | numeric           |
| guestcost          | numeric           |
| initialoutlay      | numeric           |
| monthlymaintenance | numeric           |

Şimdi de verinin nasıl göründüğüne dair ilk 3 satıra bakalım:

#+BEGIN_SRC sql
SELECT * FROM cd.facilities LIMIT 3;
#+END_SRC

#+RESULTS:
| facid | name            | membercost | guestcost | initialoutlay | monthlymaintenance |
|-------+-----------------+------------+-----------+---------------+--------------------|
|     0 | Tennis Court 1  |          5 |        25 |         10000 |                200 |
|     1 | Tennis Court 2  |          5 |        25 |          8000 |                200 |
|     2 | Badminton Court |          0 |      15.5 |          4000 |                 50 |


** Retrieve specific columns from a table
*** Question

You want to print out a list of all of the facilities and their cost to members. How would you retrieve a
list of only facility names and costs? 

*** EDA
#+begin_src sql
SELECT column_name, data_type
FROM information_schema.columns
WHERE table_name = 'facilities'
#+end_src

#+RESULTS:
| column_name         | data_type          |
|--------------------+-------------------|
| facid              | integer           |
| membercost         | numeric           |
| guestcost          | numeric           |
| initialoutlay      | numeric           |
| monthlymaintenance | numeric           |
| name               | character varying |
*** Query
#+BEGIN_SRC sql :results table
SELECT name, membercost FROM cd.facilities;
#+END_SRC

#+RESULTS:
| name            | membercost |
|-----------------+------------|
| Tennis Court 1  |          5 |
| Tennis Court 2  |          5 |
| Badminton Court |          0 |
| Table Tennis    |          0 |
| Massage Room 1  |         35 |
| Massage Room 2  |         35 |
| Squash Court    |        3.5 |
| Snooker Table   |          0 |
| Pool Table      |          0 |


** Control which rows are retrieved
*** Question
How can you produce a list of facilities that charge a fee to members?

*** EDA
#+begin_src sql
SELECT 
    table_name, 
    column_name, 
    data_type, 
    is_nullable
FROM information_schema.columns
WHERE table_schema = 'cd' 
  AND table_name IN ('members', 'bookings', 'facilities')
ORDER BY table_name, ordinal_position;
#+end_src

#+RESULTS:
| table_name  | column_name         | data_type                    | is_nullable |
|------------+--------------------+-----------------------------+------------|
| bookings   | bookid             | integer                     | NO         |
| bookings   | facid              | integer                     | NO         |
| bookings   | memid              | integer                     | NO         |
| bookings   | starttime          | timestamp without time zone | NO         |
| bookings   | slots              | integer                     | NO         |
| facilities | facid              | integer                     | NO         |
| facilities | name               | character varying           | NO         |
| facilities | membercost         | numeric                     | NO         |
| facilities | guestcost          | numeric                     | NO         |
| facilities | initialoutlay      | numeric                     | NO         |
| facilities | monthlymaintenance | numeric                     | NO         |
| members    | memid              | integer                     | NO         |
| members    | surname            | character varying           | NO         |
| members    | firstname          | character varying           | NO         |
| members    | address            | character varying           | NO         |
| members    | zipcode            | integer                     | NO         |
| members    | telephone          | character varying           | NO         |
| members    | recommendedby      | integer                     | YES        |
| members    | joindate           | timestamp without time zone | NO         |
#+begin_src sql
SELECT
    tc.table_name AS tablo,
    kcu.column_name AS kolon,
    tc.constraint_type AS anahtar_tipi,
    ccu.table_name AS referans_tablo,
    ccu.column_name AS referans_kolon
FROM information_schema.table_constraints AS tc
JOIN information_schema.key_column_usage AS kcu
  ON tc.constraint_name = kcu.constraint_name
  AND tc.table_schema = kcu.table_schema
LEFT JOIN information_schema.constraint_column_usage AS ccu
  ON ccu.constraint_name = tc.constraint_name
WHERE tc.table_schema = 'cd'
  AND tc.table_name IN ('members', 'bookings', 'facilities')
  AND tc.constraint_type IN ('PRIMARY KEY', 'FOREIGN KEY')
ORDER BY tc.table_name, tc.constraint_type DESC;
#+end_src

#+Results:
| Tablo      | Kolon         | anahtar_tipi | referans_tablo | referans_kolon |
|------------+---------------+-------------+---------------+---------------|
| bookings   | bookid        | PRIMARY KEY | bookings      | bookid        |
| bookings   | facid         | FOREIGN KEY | facilities    | facid         |
| bookings   | memid         | FOREIGN KEY | members       | memid         |
| facilities | facid         | PRIMARY KEY | facilities    | facid         |
| members    | memid         | PRIMARY KEY | members       | memid         |
| members    | recommendedby | FOREIGN KEY | members       | memid         |


*** Query
#+begin_src sql

#+end_src
